kOmegaSST/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// scale   0.001;

vertices
(
    (0.0000 0.0254 0)          //0
    (-0.0206 0.0254 0)          //1
    (-0.0206 0.0000 0)          //2
    (0.0000 0.0000 0)          //3
    (0.0000 0.0254 0.0010)     //4
    (-0.0206 0.0254 0.0010)     //5
    (-0.0206 0.0000 0.0010)     //6
    (0.0000 0.0000 0.0010)     //7

    (0.2060 0.0254 0)          //8
    (0.2060 0.0000 0)          //9
    (0.2060 0.0254 0.0010)     //10
    (0.2060 0.0000 0.0010)     //11

    (0.0000 -0.0254 0)          //12
    (0.2060 -0.0254 0)          //13
    (0.0000 -0.0254 0.0010)     //14
    (0.2060 -0.0254 0.0010)     //15

    (0.2900 0.0166 0)          //16
    (0.2900 0.0000 0)          //17
    (0.2900 0.0166 0.0010)     //18
    (0.2900 0.0000 0.0010)     //19

    (0.2900 -0.0166 0)          //20
    (0.2900 -0.0166 0.0010)     //21
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (42 51 1) SimpleGrading (((0.1 0.3 1)(0.9 0.7 1)) ((0.1 0.2 8)(0.8 0.6 1)(0.1 0.2 -5)) 1)
    hex (8 0 3 9 10 4 7 11) (412 51 1) edgeGrading (((0.975 0.925 1)(0.025 0.075 -1)) ((0.975 0.925 1)(0.025 0.075 -1)) ((0.975 0.925 1)(0.025 0.075 -1)) ((0.975 0.925 1)(0.025 0.075 -1)) 
                                                    ((0.1 0.2 8)(0.9 0.8 1)) ((0.1 0.2 8)(0.8 0.6 1)(0.1 0.2 -5)) ((0.1 0.2 8)(0.8 0.6 1)(0.1 0.2 -5)) ((0.1 0.2 8)(0.9 0.8 1))  
                                                    1 1 1 1)
    hex (9 3 12 13 11 7 14 15) (412 51 1) edgeGrading (((0.975 0.925 1)(0.025 0.075 -1)) ((0.975 0.925 1)(0.025 0.075 -1)) ((0.975 0.925 1)(0.025 0.075 -1)) ((0.975 0.925 1)(0.025 0.075 -1)) 
                                                         ((0.9 0.8 1)(0.1 0.2 -5)) ((0.1 0.2 5)(0.8 0.6 1)(0.1 0.2 -8)) ((0.1 0.2 8)(0.8 0.6 1)(0.1 0.2 -8)) ((0.9 0.8 1)(0.1 0.2 -5))
                                                         1 1 1 1)

    hex (16 8 9 17 18 10 11 19) (168 51 1) SimpleGrading (1 ((0.1 0.2 8)(0.9 0.8 1)) 1)
    hex (17 9 13 20 19 11 15 21) (168 51 1) SimpleGrading (1 ((0.9 0.8 1)(0.1 0.2 -5)) 1)

);


edges
(

);


boundary
(
    inlet
    {
        type patch;
        faces
        (
            (5 6 2 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (18 19 17 16)
            (19 21 20 17)

        );
    }

    back
    {
        type empty;
        faces
        (
            (0 1 2 3)

            (8 0 3 9)
            (9 3 12 13)

            (16 8 9 17)
            (17 9 13 20)
        );
    }

    front
    {
        type empty;
        faces
        (
            (4 5 6 7)

            (10 4 7 11)
            (11 7 14 15 )

            (18 10 11 19)
            (19 11 15 21)
        );
    }

    topFlat
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (8 10 4 0)
        );
    }

    topSlope
    {
        type wall;
        faces
        (
            (16 18 10 8)
        );
    }

    bottomFlat1
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    bottomFlat2
    {
        type wall;
        faces
        (
            (13 15 14 12)
        );
    }

    bottomSlope
    {
        type wall;
        faces
        (
            (20 21 15 13)
        );
    }
    
    left
    {
        type wall;
        faces
        (
            (12 14 7 3)
        );
    }
);


mergePatchPairs
(
);

// ************************************************************************* //


