kOmegaSST/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pcorr)"
    {
        solver           GAMG;
        smoother         DICGaussSeidel;
        tolerance        1e-3;
        relTol           0.01;
    }

    "(p|pcorr)Final"
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon|omega|nuTilda|phit)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-3;
        relTol          0.1;
    }

    "(U|k|epsilon|omega|nuTilda|phit)Final"
    {
        $U;
        tolerance       1e-3;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors    3;
    nCorrectors         2;
    momentumPredictor yes;
}


// ************************************************************************* //
